<?php
session_start();

$shopId = $_SESSION["ShopId"];
if(!isset($shopId)) {
    header("Location: login.php");
}
?>

<html xmlns="http://www.w3.org/1999/xhtml" lang="heb" dir="rtl">
<style>
    body {
        background-color: #c4d2d6;
        font-size: 18px;
        letter-spacing: 1px;
        line-height: 22px;
        padding: 10px;
    }
</style>
<h1>לוג שינוי סטאטוסים:</h1>

<br>2017/11/12 14:34:00 - סניף <b>קסטינה</b> - הזמנה מספר <b>75</b> עברה מסטאטוס <b>נאסף</b> לסטאטוס <b>הוזמן</b>.
<br>2017/11/12 14:34:03 - סניף <b>קסטינה</b> - הזמנה מספר <b>75</b> עברה מסטאטוס <b>הוזמן</b> לסטאטוס <b>נאסף</b>.
<br>2017/11/12 22:55:50 - סניף <b>קסטינה</b> - הזמנה מספר <b>80</b> עברה מסטאטוס <b>הזמנה פתוחה</b> לסטאטוס <b>הוזמן</b>.
<br>2017/11/12 22:55:54 - סניף <b>קסטינה</b> - הזמנה מספר <b>80</b> עברה מסטאטוס <b>הוזמן</b> לסטאטוס <b>הזמנה פתוחה</b>.
<br>2017/11/13 10:09:49 - סניף <b>קסטינה</b> - הזמנה מספר <b>82</b> עברה מסטאטוס <b>הזמנה פתוחה</b> לסטאטוס <b>הוזמן</b>.
<br>2017/11/13 10:13:30 - סניף <b>קסטינה</b> - הזמנה מספר <b>83</b> עברה מסטאטוס <b>הזמנה פתוחה</b> לסטאטוס <b>הוזמן</b>.